TaskTrain/api/app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "priority" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Testing no 3"], ["priority", 2], ["updated_at", "2023-03-23 11:49:40.837045"], ["id", 3]]
---
    def update
        todo = user.todos.find(params[:id]).update(todo_params)

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 2], ["id", 6], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 6]]
---
    def destroy
        todo = user.todos.find(params[:id])
        todo.destroy